cask_args appdir: '/Applications'

tap 'homebrew/bundle'

#brew 'coreutils'
#brew 'findutils'
brew 'wget'
brew 'grep'
brew 'vim'
brew 'git'
brew 'hub'
brew 'ssh-copy-id'
brew 'autojump'
brew 'direnv'
brew 'node'
brew 'htop'
#brew 'readline'
#brew 'postgresql'
#brew 'unrar'
brew 'watch'
brew 'zsh'
brew 'rsync'
#brew 'kubectl'

brew 'php'
brew 'composer'

#brew 'docker'
#brew 'docker-machine'
#brew 'docker-compose'

#cask 'dropbox'
cask '1password'
cask 'alfred'
#cask 'virtualbox'
#cask 'vagrant'
cask 'firefox'
#cask 'google-chrome'
cask 'slack'
#cask 'sequel-pro'
cask 'phpstorm'
cask 'docker'
#cask 'spotify'
#cask 'google-cloud-sdk'
#cask 'little-snitch'
#cask 'sketch'
#cask 'caffeine'
cask 'insomnia'
#cask 'microsoft-teams'
#cask 'zoom'
#cask 'notion'
