cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/homebrew-php'

brew 'coreutils'
brew 'findutils'
brew 'wget', args: ['enable-iri']
brew 'homebrew/dupes/grep'
brew 'vim'
brew 'git'
brew 'hub'
brew 'ssh-copy-id'
brew 'node'
brew 'htop'
brew 'readline'
brew 'postgresql'
brew 'unrar'
brew 'watch'
brew 'zsh'
brew 'kubectl'

brew 'php@7.2', args: ['with-intl']
brew 'composer'

cask 'caffeine'
cask 'insomnia'
cask 'dropbox'
cask '1password'
cask 'alfred'
cask 'virtualbox'
cask 'vagrant'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'sequel-pro'
cask 'phpstorm'
cask 'docker'
cask 'spotify'
cask 'sonos'
cask 'google-cloud-sdk'
cask 'little-snitch'
cask 'sketch'
