cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Shell utils
brew 'findutils'
brew 'make'
brew 'wget'
brew 'curl'
brew 'grep'
brew 'vim'
brew 'ssh-copy-id'
brew 'autojump'
brew 'direnv'
brew 'htop'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'rsync'
brew 'watch'
brew 'fzf'
brew 'pinentry-mac'

# Programming
brew 'git'
brew 'hub'
brew 'node'
brew 'tmux'
brew 'tmuxinator'
brew 'jq'

# Cloud
brew 'kubernetes-cli'
brew 'k9s'
brew 'ansible'
brew 'awsume'
brew 'dive'
brew 'helm'
brew 'kustomize'
brew 'minikube'

# PHP
brew 'php'
brew 'composer'

# Software Essentials
cask '1password7'
cask 'alfred'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'slack'
cask 'phpstorm'
cask 'docker'
cask 'obsidian'
cask 'tunnelblick'
cask 'visual-studio-code'

# Other software
cask 'sonos'
cask 'anki'
cask 'arduino'
cask 'clockify'
cask 'raspberry-pi-imager'
cask 'steam'
cask 'spotify'
cask 'vlc'
